package strings 
{
	import core.Log;
	public class Strings 
	{
		private static var _strings:Object = {
			VK:{
				FreebieWindow_sendPost			: Locale.__e('flash:1406798993612'),//"Я играю в \"Облачное Королевство\". %s", 
				Achivement_sendPost				: Locale.__e('flash:1406799041868'),//'Я получил звание \"%s\" в игре \"Облачное Королевство\". %s', 
				World_openZonePost				: Locale.__e('flash:1406799068403'),//'Я открыл новую территорию \"%s\" в игре \"Облачное Королевство\". %s',
				Animal_makePost					: Locale.__e('flash:1406799099109'),//'Я cоздал существо \"%s\" в игре \"Облачное Королевство\". %s',
				AUnit_makePost					: Locale.__e('flash:1406799117637'),//'Я построил \"%s\" в игре \"Облачное Королевство\". %s',
				Share_sendInvite				: Locale.__e('flash:1406799136508'),//"Помоги мне разбить Пасхальное яйцо. %s",
				Share_sendKickPost				: Locale.__e('flash:1406799181077'),//"Я ударил по Пасхальному яйцу в твоем сне. %s",
				LevelUpWindow_onTellBttn		: Locale.__e('flash:1406799202850'),//"Я достиг %d уровня в игре \"Облачное Королевство\". %s",
				QuestRewardWindow_onTellEvent	: Locale.__e('flash:1406799219011'),//'Я прошел задание \"%s\" в игре \"Облачное Королевство\". %s',
				Gifts_send						: Locale.__e('flash:1406799235626'),//'Я подарил тебе подарок \"%s\" в игре \"Облачное Королевство\". Заходи быстрее, чтобы забрать его. %s',
				Gifts_ask						: Locale.__e('flash:1406799253363'),//"%s %s никак не может найти \"%s\". Отправьте подарок вашему другу! %s",
				Tree_makePost					: Locale.__e('flash:1406799269602'),//"Помоги мне вырастить дерево. %s",
				Instance_invite_all				: Locale.__e('flash:1406799288659'),//"Мне срочно нужна помощь с прохождением \"%s\" в игре \"Облачное Королевство\". %s",
				Instance_invite					: Locale.__e('flash:1406799304426'),//"Мне нужна помощь с прохождением \"%s\". Заходи скорее, вместе будет веселей!. %s",
				Invate_friend					: Locale.__e('flash:1406799321666'),//"Заходи скорее, вместе будет веселей!. %s"
				WakeUp_sendPost					: Locale.__e('flash:1449487475391')//"Скорее возвращайся в игру! Мне нужна твоя помощь! %s"
			},
			
			FS:{
				FreebieWindow_sendPost			: Locale.__e('flash:1406798993612'),//"Я играю в \"Облачное Королевство\". %s", 
				Achivement_sendPost				: Locale.__e('flash:1406799041868'),//'Я получил звание \"%s\" в игре \"Облачное Королевство\". %s', 
				World_openZonePost				: Locale.__e('flash:1406799068403'),//'Я открыл новую территорию \"%s\" в игре \"Облачное Королевство\". %s',
				Animal_makePost					: Locale.__e('flash:1406799099109'),//'Я cоздал существо \"%s\" в игре \"Облачное Королевство\". %s',
				AUnit_makePost					: Locale.__e('flash:1406799117637'),//'Я построил \"%s\" в игре \"Облачное Королевство\". %s',
				Share_sendInvite				: Locale.__e('flash:1406799136508'),//"Помоги мне разбить Пасхальное яйцо. %s",
				Share_sendKickPost				: Locale.__e('flash:1406799181077'),//"Я ударил по Пасхальному яйцу в твоем сне. %s",
				LevelUpWindow_onTellBttn		: Locale.__e('flash:1406799202850'),//"Я достиг %d уровня в игре \"Облачное Королевство\". %s",
				QuestRewardWindow_onTellEvent	: Locale.__e('flash:1406799219011'),//'Я прошел задание \"%s\" в игре \"Облачное Королевство\". %s',
				Gifts_send						: Locale.__e('flash:1406799235626'),//'Я подарил тебе подарок \"%s\" в игре \"Облачное Королевство\". Заходи быстрее, чтобы забрать его. %s',
				Gifts_ask						: Locale.__e('flash:1406799253363'),//"%s %s никак не может найти \"%s\". Отправьте подарок вашему другу! %s",
				Tree_makePost					: Locale.__e('flash:1406799269602'),//"Помоги мне вырастить дерево. %s",
				Instance_invite_all				: Locale.__e('flash:1406799288659'),//"Мне срочно нужна помощь с прохождением \"%s\" в игре \"Облачное Королевство\". %s",
				Instance_invite					: Locale.__e('flash:1406799304426'),//"Мне нужна помощь с прохождением \"%s\". Заходи скорее, вместе будет веселей!. %s",
				Invate_friend					: Locale.__e('flash:1406799321666'),//"Заходи скорее, вместе будет веселей!. %s"
				WakeUp_sendPost					: Locale.__e('flash:1449487475391')//"Скорее возвращайся в игру! Мне нужна твоя помощь! %s"
			},
			
			DM:{
				FreebieWindow_sendPost			: Locale.__e('flash:1406798993612'),//"Я играю в \"Облачное Королевство\". %s",
				Achivement_sendPost				: Locale.__e('flash:1406799041868'),//'Я получил звание \"%s\" в игре \"Облачное Королевство\". %s', 
				World_openZonePost				: Locale.__e('flash:1406799068403'),//'Я открыл новую территорию \"%s\" в игре \"Облачное Королевство\". %s',
				Animal_makePost					: Locale.__e('flash:1406799099109'),//'Я cоздал существо \"%s\" в игре \"Облачное Королевство\". %s',
				AUnit_makePost					: Locale.__e('flash:1406799117637'),//'Я построил \"%s\" в игре \"Облачное Королевство\". %s',
				Share_sendInvite				: Locale.__e('flash:1406799136508'),//"Помоги мне разбить Пасхальное яйцо. %s",
				Share_sendKickPost				: Locale.__e('flash:1406799181077'),//"Я ударил по Пасхальному яйцу в твоем сне. %s",
				LevelUpWindow_onTellBttn		: Locale.__e('flash:1406799202850'),//"Я достиг %d уровня в игре \"Облачное Королевство\". %s",
				QuestRewardWindow_onTellEvent	: Locale.__e('flash:1406799219011'),//'Я прошел задание \"%s\" в игре \"Облачное Королевство\". %s',
				Gifts_send						: Locale.__e('flash:1406799235626'),//'Я подарил тебе подарок \"%s\" в игре \"Облачное Королевство\". Заходи быстрее, чтобы забрать его. %s',
				Gifts_ask						: Locale.__e('flash:1406799253363'),//"%s %s никак не может найти \"%s\". Отправьте подарок вашему другу! %s",
				Tree_makePost					: Locale.__e('flash:1406799269602'),//"Помоги мне вырастить дерево. %s",
				Instance_invite_all				: Locale.__e('flash:1406799288659'),//"Мне срочно нужна помощь с прохождением \"%s\" в игре \"Облачное Королевство\". %s",
				Instance_invite					: Locale.__e('flash:1406799304426'),//"Мне нужна помощь с прохождением \"%s\". Заходи скорее, вместе будет веселей!. %s"
				Invate_friend					: Locale.__e('flash:1406799321666'),//"Заходи скорее, вместе будет веселей!. %s"
				WakeUp_sendPost					: Locale.__e('flash:1449487475391')//"Скорее возвращайся в игру! Мне нужна твоя помощь! %s"
			},
			
			OK:{
				FreebieWindow_sendPost			: Locale.__e('flash:1408695922171'),//"Я играю в \"Облачное Королевство\". %s",
				Achivement_sendPost				: Locale.__e('flash:1408615204962'),//'Я получил звание \"%s\" в игре \"Облачное Королевство\". %s', 
				World_openZonePost				: Locale.__e('flash:1408615269508'),//'Я открыл новую территорию \"%s\" в игре \"Облачное Королевство\". %s',
				Animal_makePost					: Locale.__e('flash:1408696037109'),//'Я cоздал существо \"%s\" в игре \"Облачное Королевство\". %s',
				AUnit_makePost					: Locale.__e('flash:1408615314533'),//'Я построил \"%s\" в игре \"Облачное Королевство\". %s',
				Share_sendInvite				: Locale.__e('flash:1406799136508'),//"Помоги мне разбить Пасхальное яйцо. %s",
				Share_sendKickPost				: Locale.__e('flash:1406799181077'),//"Я ударил по Пасхальному яйцу в твоем сне. %s",
				LevelUpWindow_onTellBttn		: Locale.__e('flash:1408615355554'),//"Я достиг %d уровня в игре \"Облачное Королевство\". %s",
				QuestRewardWindow_onTellEvent	: Locale.__e('flash:1408615495710'),//'Я прошел задание \"%s\" в игре \"Облачное Королевство\". %s',
				Gifts_send						: Locale.__e('flash:1408696160744'),//'Я подарил тебе подарок \"%s\" в игре \"Облачное Королевство\". Заходи быстрее, чтобы забрать его. %s',
				Gifts_ask						: Locale.__e('flash:1408696228551'),//"%s %s никак не может найти \"%s\". Отправьте подарок вашему другу! %s",
				Tree_makePost					: Locale.__e('flash:1408696271368'),//"Помоги мне вырастить дерево. %s",
				Instance_invite_all				: Locale.__e('flash:1408696296640'),//"Мне срочно нужна помощь с прохождением \"%s\" в игре \"Облачное Королевство\". %s",
				Instance_invite					: Locale.__e('flash:1408696320776'),//"Мне нужна помощь с прохождением \"%s\". Заходи скорее, вместе будет веселей!. %s"
				Invate_friend					: Locale.__e('flash:1408696336510'),//"Заходи скорее, вместе будет веселей!. %s"
				WakeUp_sendPost					: Locale.__e('flash:1449487475391')//"Скорее возвращайся в игру! Мне нужна твоя помощь! %s"
			},
			
			
			ML:{FreebieWindow_sendPost			: Locale.__e('flash:1408695922171'),//"Я играю в \"Облачное Королевство\". %s",
				Achivement_sendPost				: Locale.__e('flash:1408615204962'),//'Я получил звание \"%s\" в игре \"Облачное Королевство\". %s', 
				World_openZonePost				: Locale.__e('flash:1408615269508'),//'Я открыл новую территорию \"%s\" в игре \"Облачное Королевство\". %s',
				Animal_makePost					: Locale.__e('flash:1408696037109'),//'Я cоздал существо \"%s\" в игре \"Облачное Королевство\". %s',
				AUnit_makePost					: Locale.__e('flash:1408615314533'),//'Я построил \"%s\" в игре \"Облачное Королевство\". %s',
				Share_sendInvite				: Locale.__e('flash:1406799136508'),//"Помоги мне разбить Пасхальное яйцо. %s",
				Share_sendKickPost				: Locale.__e('flash:1406799181077'),//"Я ударил по Пасхальному яйцу в твоем сне. %s",
				LevelUpWindow_onTellBttn		: Locale.__e('flash:1408615355554'),//"Я достиг %d уровня в игре \"Облачное Королевство\". %s",
				QuestRewardWindow_onTellEvent	: Locale.__e('flash:1408615495710'),//'Я прошел задание \"%s\" в игре \"Облачное Королевство\". %s',
				Gifts_send						: Locale.__e('flash:1408696160744'),//'Я подарил тебе подарок \"%s\" в игре \"Облачное Королевство\". Заходи быстрее, чтобы забрать его. %s',
				Gifts_ask						: Locale.__e('flash:1408696228551'),//"%s %s никак не может найти \"%s\". Отправьте подарок вашему другу! %s",
				Tree_makePost					: Locale.__e('flash:1408696271368'),//"Помоги мне вырастить дерево. %s",
				Instance_invite_all				: Locale.__e('flash:1408696296640'),//"Мне срочно нужна помощь с прохождением \"%s\" в игре \"Облачное Королевство\". %s",
				Instance_invite					: Locale.__e('flash:1408696320776'),//"Мне нужна помощь с прохождением \"%s\". Заходи скорее, вместе будет веселей!. %s"
				Invate_friend					: Locale.__e('flash:1408696336510'),//"Заходи скорее, вместе будет веселей!. %s"
				WakeUp_sendPost					: Locale.__e('flash:1449487475391')//"Скорее возвращайся в игру! Мне нужна твоя помощь! %s"
			},
			
			FB: {
				FreebieWindow_sendPost			: Locale.__e('flash:1408695922171'),//"Я играю в \"Облачное Королевство\". %s",
				Achivement_sendPost				: Locale.__e('flash:1408615204962'),//'Я получил звание \"%s\" в игре \"Облачное Королевство\". %s', 
				World_openZonePost				: Locale.__e('flash:1408615269508'),//'Я открыл новую территорию \"%s\" в игре \"Облачное Королевство\". %s',
				Animal_makePost					: Locale.__e('flash:1408696037109'),//'Я cоздал существо \"%s\" в игре \"Облачное Королевство\". %s',
				AUnit_makePost					: Locale.__e('flash:1408615314533'),//'Я построил \"%s\" в игре \"Облачное Королевство\". %s',
				Share_sendInvite				: Locale.__e('flash:1406799136508'),//"Помоги мне разбить Пасхальное яйцо. %s",
				Share_sendKickPost				: Locale.__e('flash:1406799181077'),//"Я ударил по Пасхальному яйцу в твоем сне. %s",
				LevelUpWindow_onTellBttn		: Locale.__e('flash:1408615355554'),//"Я достиг %d уровня в игре \"Облачное Королевство\". %s",
				QuestRewardWindow_onTellEvent	: Locale.__e('flash:1408615495710'),//'Я прошел задание \"%s\" в игре \"Облачное Королевство\". %s',
				Gifts_send						: Locale.__e('flash:1408696160744'),//'Я подарил тебе подарок \"%s\" в игре \"Облачное Королевство\". Заходи быстрее, чтобы забрать его. %s',
				Gifts_ask						: Locale.__e('flash:1408696228551'),//"%s %s никак не может найти \"%s\". Отправьте подарок вашему другу! %s",
				Tree_makePost					: Locale.__e('flash:1408696271368'),//"Помоги мне вырастить дерево. %s",
				Instance_invite_all				: Locale.__e('flash:1408696296640'),//"Мне срочно нужна помощь с прохождением \"%s\" в игре \"Облачное Королевство\". %s",
				Instance_invite					: Locale.__e('flash:1408696320776'),//"Мне нужна помощь с прохождением \"%s\". Заходи скорее, вместе будет веселей!. %s"
				Invate_friend					: Locale.__e('flash:1408696336510'),//"Заходи скорее, вместе будет веселей!. %s"
				WakeUp_sendPost					: Locale.__e('flash:1449487475391')//"Скорее возвращайся в игру! Мне нужна твоя помощь! %s"
			},
			
			NK:{
				FreebieWindow_sendPost			: Locale.__e('flash:1408695922171'),//"Я играю в \"Облачное Королевство\". %s",
				Achivement_sendPost				: Locale.__e('flash:1408615204962'),//'Я получил звание \"%s\" в игре \"Облачное Королевство\". %s', 
				World_openZonePost				: Locale.__e('flash:1408615269508'),//'Я открыл новую территорию \"%s\" в игре \"Облачное Королевство\". %s',
				Animal_makePost					: Locale.__e('flash:1408696037109'),//'Я cоздал существо \"%s\" в игре \"Облачное Королевство\". %s',
				AUnit_makePost					: Locale.__e('flash:1408615314533'),//'Я построил \"%s\" в игре \"Облачное Королевство\". %s',
				Share_sendInvite				: Locale.__e('flash:1406799136508'),//"Помоги мне разбить Пасхальное яйцо. %s",
				Share_sendKickPost				: Locale.__e('flash:1406799181077'),//"Я ударил по Пасхальному яйцу в твоем сне. %s",
				LevelUpWindow_onTellBttn		: Locale.__e('flash:1408615355554'),//"Я достиг %d уровня в игре \"Облачное Королевство\". %s",
				QuestRewardWindow_onTellEvent	: Locale.__e('flash:1408615495710'),//'Я прошел задание \"%s\" в игре \"Облачное Королевство\". %s',
				Gifts_send						: Locale.__e('flash:1408696160744'),//'Я подарил тебе подарок \"%s\" в игре \"Облачное Королевство\". Заходи быстрее, чтобы забрать его. %s',
				Gifts_ask						: Locale.__e('flash:1408696228551'),//"%s %s никак не может найти \"%s\". Отправьте подарок вашему другу! %s",
				Tree_makePost					: Locale.__e('flash:1408696271368'),//"Помоги мне вырастить дерево. %s",
				Instance_invite_all				: Locale.__e('flash:1408696296640'),//"Мне срочно нужна помощь с прохождением \"%s\" в игре \"Облачное Королевство\". %s",
				Instance_invite					: Locale.__e('flash:1408696320776'),//"Мне нужна помощь с прохождением \"%s\". Заходи скорее, вместе будет веселей!. %s"
				Invate_friend					: Locale.__e('flash:1408696336510'),//"Заходи скорее, вместе будет веселей!. %s"
				WakeUp_sendPost					: Locale.__e('flash:1449487475391')//"Скорее возвращайся в игру! Мне нужна твоя помощь! %s"
			},
			
			HV:{
				FreebieWindow_sendPost			: Locale.__e('flash:1408695922171'),//"Я играю в \"Облачное Королевство\". %s",
				Achivement_sendPost				: Locale.__e('flash:1408615204962'),//'Я получил звание \"%s\" в игре \"Облачное Королевство\". %s', 
				World_openZonePost				: Locale.__e('flash:1408615269508'),//'Я открыл новую территорию \"%s\" в игре \"Облачное Королевство\". %s',
				Animal_makePost					: Locale.__e('flash:1408696037109'),//'Я cоздал существо \"%s\" в игре \"Облачное Королевство\". %s',
				AUnit_makePost					: Locale.__e('flash:1408615314533'),//'Я построил \"%s\" в игре \"Облачное Королевство\". %s',
				Share_sendInvite				: Locale.__e('flash:1406799136508'),//"Помоги мне разбить Пасхальное яйцо. %s",
				Share_sendKickPost				: Locale.__e('flash:1406799181077'),//"Я ударил по Пасхальному яйцу в твоем сне. %s",
				LevelUpWindow_onTellBttn		: Locale.__e('flash:1408615355554'),//"Я достиг %d уровня в игре \"Облачное Королевство\". %s",
				QuestRewardWindow_onTellEvent	: Locale.__e('flash:1408615495710'),//'Я прошел задание \"%s\" в игре \"Облачное Королевство\". %s',
				Gifts_send						: Locale.__e('flash:1408696160744'),//'Я подарил тебе подарок \"%s\" в игре \"Облачное Королевство\". Заходи быстрее, чтобы забрать его. %s',
				Gifts_ask						: Locale.__e('flash:1408696228551'),//"%s %s никак не может найти \"%s\". Отправьте подарок вашему другу! %s",
				Tree_makePost					: Locale.__e('flash:1408696271368'),//"Помоги мне вырастить дерево. %s",
				Instance_invite_all				: Locale.__e('flash:1408696296640'),//"Мне срочно нужна помощь с прохождением \"%s\" в игре \"Облачное Королевство\". %s",
				Instance_invite					: Locale.__e('flash:1408696320776'),//"Мне нужна помощь с прохождением \"%s\". Заходи скорее, вместе будет веселей!. %s"
				Invate_friend					: Locale.__e('flash:1408696336510'),//"Заходи скорее, вместе будет веселей!. %s"
				WakeUp_sendPost					: Locale.__e('flash:1449487475391')//"Скорее возвращайся в игру! Мне нужна твоя помощь! %s"
			},
			
			YN:{
				FreebieWindow_sendPost			: Locale.__e('flash:1408695922171'),//"Я играю в \"Облачное Королевство\". %s",
				Achivement_sendPost				: Locale.__e('flash:1408615204962'),//'Я получил звание \"%s\" в игре \"Облачное Королевство\". %s', 
				World_openZonePost				: Locale.__e('flash:1408615269508'),//'Я открыл новую территорию \"%s\" в игре \"Облачное Королевство\". %s',
				Animal_makePost					: Locale.__e('flash:1408696037109'),//'Я cоздал существо \"%s\" в игре \"Облачное Королевство\". %s',
				AUnit_makePost					: Locale.__e('flash:1408615314533'),//'Я построил \"%s\" в игре \"Облачное Королевство\". %s',
				Share_sendInvite				: Locale.__e('flash:1406799136508'),//"Помоги мне разбить Пасхальное яйцо. %s",
				Share_sendKickPost				: Locale.__e('flash:1406799181077'),//"Я ударил по Пасхальному яйцу в твоем сне. %s",
				LevelUpWindow_onTellBttn		: Locale.__e('flash:1408615355554'),//"Я достиг %d уровня в игре \"Облачное Королевство\". %s",
				QuestRewardWindow_onTellEvent	: Locale.__e('flash:1408615495710'),//'Я прошел задание \"%s\" в игре \"Облачное Королевство\". %s',
				Gifts_send						: Locale.__e('flash:1408696160744'),//'Я подарил тебе подарок \"%s\" в игре \"Облачное Королевство\". Заходи быстрее, чтобы забрать его. %s',
				Gifts_ask						: Locale.__e('flash:1408696228551'),//"%s %s никак не может найти \"%s\". Отправьте подарок вашему другу! %s",
				Tree_makePost					: Locale.__e('flash:1408696271368'),//"Помоги мне вырастить дерево. %s",
				Instance_invite_all				: Locale.__e('flash:1408696296640'),//"Мне срочно нужна помощь с прохождением \"%s\" в игре \"Облачное Королевство\". %s",
				Instance_invite					: Locale.__e('flash:1408696320776'),//"Мне нужна помощь с прохождением \"%s\". Заходи скорее, вместе будет веселей!. %s"
				Invate_friend					: Locale.__e('flash:1408696336510'),//"Заходи скорее, вместе будет веселей!. %s"
				WakeUp_sendPost					: Locale.__e('flash:1449487475391')//"Скорее возвращайся в игру! Мне нужна твоя помощь! %s"
			},
			
			YB:{
				FreebieWindow_sendPost			: Locale.__e('flash:1408695922171'),//"Я играю в \"Облачное Королевство\". %s",
				Achivement_sendPost				: Locale.__e('flash:1408615204962'),//'Я получил звание \"%s\" в игре \"Облачное Королевство\". %s', 
				World_openZonePost				: Locale.__e('flash:1408615269508'),//'Я открыл новую территорию \"%s\" в игре \"Облачное Королевство\". %s',
				Animal_makePost					: Locale.__e('flash:1408696037109'),//'Я cоздал существо \"%s\" в игре \"Облачное Королевство\". %s',
				AUnit_makePost					: Locale.__e('flash:1408615314533'),//'Я построил \"%s\" в игре \"Облачное Королевство\". %s',
				Share_sendInvite				: Locale.__e('flash:1406799136508'),//"Помоги мне разбить Пасхальное яйцо. %s",
				Share_sendKickPost				: Locale.__e('flash:1406799181077'),//"Я ударил по Пасхальному яйцу в твоем сне. %s",
				LevelUpWindow_onTellBttn		: Locale.__e('flash:1408615355554'),//"Я достиг %d уровня в игре \"Облачное Королевство\". %s",
				QuestRewardWindow_onTellEvent	: Locale.__e('flash:1408615495710'),//'Я прошел задание \"%s\" в игре \"Облачное Королевство\". %s',
				Gifts_send						: Locale.__e('flash:1408696160744'),//'Я подарил тебе подарок \"%s\" в игре \"Облачное Королевство\". Заходи быстрее, чтобы забрать его. %s',
				Gifts_ask						: Locale.__e('flash:1408696228551'),//"%s %s никак не может найти \"%s\". Отправьте подарок вашему другу! %s",
				Tree_makePost					: Locale.__e('flash:1408696271368'),//"Помоги мне вырастить дерево. %s",
				Instance_invite_all				: Locale.__e('flash:1408696296640'),//"Мне срочно нужна помощь с прохождением \"%s\" в игре \"Облачное Королевство\". %s",
				Instance_invite					: Locale.__e('flash:1408696320776'),//"Мне нужна помощь с прохождением \"%s\". Заходи скорее, вместе будет веселей!. %s"
				Invate_friend					: Locale.__e('flash:1408696336510'),//"Заходи скорее, вместе будет веселей!. %s"
				WakeUp_sendPost					: Locale.__e('flash:1449487475391')//"Скорее возвращайся в игру! Мне нужна твоя помощь! %s"
			},
			
			MX:{
				FreebieWindow_sendPost			: Locale.__e('flash:1408695922171'),//"Я играю в \"Облачное Королевство\". %s",
				Achivement_sendPost				: Locale.__e('flash:1408615204962'),//'Я получил звание \"%s\" в игре \"Облачное Королевство\". %s', 
				World_openZonePost				: Locale.__e('flash:1408615269508'),//'Я открыл новую территорию \"%s\" в игре \"Облачное Королевство\". %s',
				Animal_makePost					: Locale.__e('flash:1408696037109'),//'Я cоздал существо \"%s\" в игре \"Облачное Королевство\". %s',
				AUnit_makePost					: Locale.__e('flash:1408615314533'),//'Я построил \"%s\" в игре \"Облачное Королевство\". %s',
				Share_sendInvite				: Locale.__e('flash:1406799136508'),//"Помоги мне разбить Пасхальное яйцо. %s",
				Share_sendKickPost				: Locale.__e('flash:1406799181077'),//"Я ударил по Пасхальному яйцу в твоем сне. %s",
				LevelUpWindow_onTellBttn		: Locale.__e('flash:1408615355554'),//"Я достиг %d уровня в игре \"Облачное Королевство\". %s",
				QuestRewardWindow_onTellEvent	: Locale.__e('flash:1408615495710'),//'Я прошел задание \"%s\" в игре \"Облачное Королевство\". %s',
				Gifts_send						: Locale.__e('flash:1408696160744'),//'Я подарил тебе подарок \"%s\" в игре \"Облачное Королевство\". Заходи быстрее, чтобы забрать его. %s',
				Gifts_ask						: Locale.__e('flash:1408696228551'),//"%s %s никак не может найти \"%s\". Отправьте подарок вашему другу! %s",
				Tree_makePost					: Locale.__e('flash:1408696271368'),//"Помоги мне вырастить дерево. %s",
				Instance_invite_all				: Locale.__e('flash:1408696296640'),//"Мне срочно нужна помощь с прохождением \"%s\" в игре \"Облачное Королевство\". %s",
				Instance_invite					: Locale.__e('flash:1408696320776'),//"Мне нужна помощь с прохождением \"%s\". Заходи скорее, вместе будет веселей!. %s"
				Invate_friend					: Locale.__e('flash:1408696336510'),//"Заходи скорее, вместе будет веселей!. %s"
				WakeUp_sendPost					: Locale.__e('flash:1449487475391')//"Скорее возвращайся в игру! Мне нужна твоя помощь! %s"
			},
			
			SP:{
				FreebieWindow_sendPost			: Locale.__e('flash:1408695922171'),//"Я играю в \"Облачное Королевство\". %s",
				Achivement_sendPost				: Locale.__e('flash:1408615204962'),//'Я получил звание \"%s\" в игре \"Облачное Королевство\". %s', 
				World_openZonePost				: Locale.__e('flash:1408615269508'),//'Я открыл новую территорию \"%s\" в игре \"Облачное Королевство\". %s',
				Animal_makePost					: Locale.__e('flash:1408696037109'),//'Я cоздал существо \"%s\" в игре \"Облачное Королевство\". %s',
				AUnit_makePost					: Locale.__e('flash:1408615314533'),//'Я построил \"%s\" в игре \"Облачное Королевство\". %s',
				Share_sendInvite				: Locale.__e('flash:1406799136508'),//"Помоги мне разбить Пасхальное яйцо. %s",
				Share_sendKickPost				: Locale.__e('flash:1406799181077'),//"Я ударил по Пасхальному яйцу в твоем сне. %s",
				LevelUpWindow_onTellBttn		: Locale.__e('flash:1408615355554'),//"Я достиг %d уровня в игре \"Облачное Королевство\". %s",
				QuestRewardWindow_onTellEvent	: Locale.__e('flash:1408615495710'),//'Я прошел задание \"%s\" в игре \"Облачное Королевство\". %s',
				Gifts_send						: Locale.__e('flash:1408696160744'),//'Я подарил тебе подарок \"%s\" в игре \"Облачное Королевство\". Заходи быстрее, чтобы забрать его. %s',
				Gifts_ask						: Locale.__e('flash:1408696228551'),//"%s %s никак не может найти \"%s\". Отправьте подарок вашему другу! %s",
				Tree_makePost					: Locale.__e('flash:1408696271368'),//"Помоги мне вырастить дерево. %s",
				Instance_invite_all				: Locale.__e('flash:1408696296640'),//"Мне срочно нужна помощь с прохождением \"%s\" в игре \"Облачное Королевство\". %s",
				Instance_invite					: Locale.__e('flash:1408696320776'),//"Мне нужна помощь с прохождением \"%s\". Заходи скорее, вместе будет веселей!. %s"
				Invate_friend					: Locale.__e('flash:1408696336510'),//"Заходи скорее, вместе будет веселей!. %s"
				WakeUp_sendPost					: Locale.__e('flash:1449487475391')//"Скорее возвращайся в игру! Мне нужна твоя помощь! %s"
			},
			
			AI:{
				FreebieWindow_sendPost			: Locale.__e('flash:1408695922171'),//"Я играю в \"Облачное Королевство\". %s",
				Achivement_sendPost				: Locale.__e('flash:1408615204962'),//'Я получил звание \"%s\" в игре \"Облачное Королевство\". %s', 
				World_openZonePost				: Locale.__e('flash:1408615269508'),//'Я открыл новую территорию \"%s\" в игре \"Облачное Королевство\". %s',
				Animal_makePost					: Locale.__e('flash:1408696037109'),//'Я cоздал существо \"%s\" в игре \"Облачное Королевство\". %s',
				AUnit_makePost					: Locale.__e('flash:1408615314533'),//'Я построил \"%s\" в игре \"Облачное Королевство\". %s',
				Share_sendInvite				: Locale.__e('flash:1406799136508'),//"Помоги мне разбить Пасхальное яйцо. %s",
				Share_sendKickPost				: Locale.__e('flash:1406799181077'),//"Я ударил по Пасхальному яйцу в твоем сне. %s",
				LevelUpWindow_onTellBttn		: Locale.__e('flash:1408615355554'),//"Я достиг %d уровня в игре \"Облачное Королевство\". %s",
				QuestRewardWindow_onTellEvent	: Locale.__e('flash:1408615495710'),//'Я прошел задание \"%s\" в игре \"Облачное Королевство\". %s',
				Gifts_send						: Locale.__e('flash:1408696160744'),//'Я подарил тебе подарок \"%s\" в игре \"Облачное Королевство\". Заходи быстрее, чтобы забрать его. %s',
				Gifts_ask						: Locale.__e('flash:1408696228551'),//"%s %s никак не может найти \"%s\". Отправьте подарок вашему другу! %s",
				Tree_makePost					: Locale.__e('flash:1408696271368'),//"Помоги мне вырастить дерево. %s",
				Instance_invite_all				: Locale.__e('flash:1408696296640'),//"Мне срочно нужна помощь с прохождением \"%s\" в игре \"Облачное Королевство\". %s",
				Instance_invite					: Locale.__e('flash:1408696320776'),//"Мне нужна помощь с прохождением \"%s\". Заходи скорее, вместе будет веселей!. %s"
				Invate_friend					: Locale.__e('flash:1408696336510'),//"Заходи скорее, вместе будет веселей!. %s"
				WakeUp_sendPost					: Locale.__e('flash:1449487475391')//"Скорее возвращайся в игру! Мне нужна твоя помощь! %s"
			},
			
			GN:{
				FreebieWindow_sendPost			: Locale.__e('flash:1408695922171'),//"Я играю в \"Облачное Королевство\". %s",
				Achivement_sendPost				: Locale.__e('flash:1408615204962'),//'Я получил звание \"%s\" в игре \"Облачное Королевство\". %s', 
				World_openZonePost				: Locale.__e('flash:1408615269508'),//'Я открыл новую территорию \"%s\" в игре \"Облачное Королевство\". %s',
				Animal_makePost					: Locale.__e('flash:1408696037109'),//'Я cоздал существо \"%s\" в игре \"Облачное Королевство\". %s',
				AUnit_makePost					: Locale.__e('flash:1408615314533'),//'Я построил \"%s\" в игре \"Облачное Королевство\". %s',
				Share_sendInvite				: Locale.__e('flash:1406799136508'),//"Помоги мне разбить Пасхальное яйцо. %s",
				Share_sendKickPost				: Locale.__e('flash:1406799181077'),//"Я ударил по Пасхальному яйцу в твоем сне. %s",
				LevelUpWindow_onTellBttn		: Locale.__e('flash:1408615355554'),//"Я достиг %d уровня в игре \"Облачное Королевство\". %s",
				QuestRewardWindow_onTellEvent	: Locale.__e('flash:1408615495710'),//'Я прошел задание \"%s\" в игре \"Облачное Королевство\". %s',
				Gifts_send						: Locale.__e('flash:1408696160744'),//'Я подарил тебе подарок \"%s\" в игре \"Облачное Королевство\". Заходи быстрее, чтобы забрать его. %s',
				Gifts_ask						: Locale.__e('flash:1408696228551'),//"%s %s никак не может найти \"%s\". Отправьте подарок вашему другу! %s",
				Tree_makePost					: Locale.__e('flash:1408696271368'),//"Помоги мне вырастить дерево. %s",
				Instance_invite_all				: Locale.__e('flash:1408696296640'),//"Мне срочно нужна помощь с прохождением \"%s\" в игре \"Облачное Королевство\". %s",
				Instance_invite					: Locale.__e('flash:1408696320776'),//"Мне нужна помощь с прохождением \"%s\". Заходи скорее, вместе будет веселей!. %s"
				Invate_friend					: Locale.__e('flash:1408696336510'),//"Заходи скорее, вместе будет веселей!. %s"
				WakeUp_sendPost					: Locale.__e('flash:1449487475391')//"Скорее возвращайся в игру! Мне нужна твоя помощь! %s"
			}
		};
		
		
		public function Strings() 
		{
			
		}
		
		public static function __e(label:String, params:Array):String {
			Log.alert(label);
			Log.alert(params);
			if (_strings[App.social][label] != undefined) {
				return Locale.__e(_strings[App.social][label], params);
			}else {
				return label;
			}
		}
	}

}